{
  "MTR 535": {
    "courseListName": "MTR 535",
    "courseTitle": "Intro To Bioinformatics"
  },
  "MTR 604": {
    "courseListName": "MTR 604",
    "courseTitle": "Scientific & Ethical Conduct"
  },
  "MTR 605": {
    "courseListName": "MTR 605",
    "courseTitle": "Manuscript Writing"
  },
  "MTR 606": {
    "courseListName": "MTR 606",
    "courseTitle": "Grantsmanship"
  },
  "MTR 607": {
    "courseListName": "MTR 607",
    "courseTitle": "Candidates are expected to complete a thesis that involves designing a research project, writing a formal research proposal, performing the study described in it, preparing a comprehensive scholarly scientific paper reporting the results, and presenting and defending the thesis at a public seminar.  At the time of application, each candidate specifies the project they will pursue, along with the lead mentor who will supervise the project."
  },
  "MTR 608": {
    "courseListName": "MTR 608",
    "courseTitle": "Candidates are expected to complete a thesis that involves designing a researchproject, writing a formal research proposal, performing the study described in it, preparing a comprehensive scholarly scientific paper reporting the results, and presenting and defending the thesis at a public seminar.  At the time of application, each candidate specifies the project they will pursue along with the lead mentor who will supervise the project."
  },
  "MTR 620": {
    "courseListName": "MTR 620",
    "courseTitle": "Content is focused on an overview of methodological approaches to the discovery, preclinical evaluation, and clinical development of novel therapeutics including devices, small molecules, biologics, vaccine, cell based therapies, and antibodies.  Practical steps needed for real world transfer of academic technology to the patient setting will be emphasized including disclosure, patenting, licensing, business development and marketing."
  },
  "MTR 630": {
    "courseListName": "MTR 630",
    "courseTitle": "Introduction to Drug Development"
  }
}